insert into Rolle values(default, 'Воспитатель'), 
	(default, 'Помощник воспитателя'), 
	(default, 'Педагог');

insert into Worker values(default, 'Иванова Марья Ивановна', 1), 
    (default, 'Петрова Ольга Ивановна', 1),
    (default, 'Семёнова Марья Сергеевна', 1),
    (default, 'Котова Дарья Ивановна', 1),
    (default, 'Каучук Степан Михайлович', 3),
    (default, 'Кравчева Марья Ивановна', 2),
    (default, 'Иванова Галина Ивановна', 2);

insert into Add_lesson values(default,'Лепка', 500, 5);

insert into Typpe values(default, 'Общеразвивающая', 35),
	(default, 'Офтольмологическая', 20),
    (default, 'Логопедическая', 20); 

insert into Groupp values(default, 'Лютики', 1, '2011-09-01', '2016-06-01'),
	(default, 'Ромашки', 2, '2011-09-01', '2016-06-01');

insert into worker_place values(1,1, '2010-09-01', null),
    (2,1, '2011-09-01', null),
    (6,1, '2011-09-01', null),
    (3,2, '2011-09-01', null),
    (4,2, '2011-09-01', null),
    (7,2, '2011-09-01', null);
    
insert into delegatte values(default,'Иванова','Ольга','Викторовна','89912391222','где-то'),
	(default,'Катькин','Олег','Викторович','89912391222','где-то'),
    (default,'Петрова','Ольга','Викторовна','89912391222','где-то'),
    (default,'Семенов','Игорь','Викторович','89912391222','где-то'),
    (default,'Иванкова','Ольга','Викторовна','89912391222','где-то');

insert into child_card values(default,'Иван','Иванов','Иванович','2009-03-04',54123,',бла-бла-бла','2011-08-12',1),
	(default,'Петр','Иванов','Иванович','2009-03-04',54122,',бла-бла-бла','2011-08-12',1),
    (default,'Екатерина','Катькина','Ивановна','2008-12-04',54124,',бла-бла-бла','2011-08-10',2),
    (default,'Николай','Петров','Иванович','2009-05-04',54125,',бла-бла-бла','2011-07-26',3),
    (default,'Иван','Семенов','Иванович','2009-03-04',54127,',бла-бла-бла','2011-08-12',4),
    (default,'Игорь','Иванков','Иванович','2009-03-04',54121,',бла-бла-бла','2011-08-12',5);

insert into Orderr values(default, 1, '2010-08-12',1), 
	(default, 1, '2011-08-12',2), 
    (default, 1, '2011-08-10',3),
    (default, 2, '2011-08-12',4),
    (default, 2, '2011-08-12',5),
    (default, 2, '2011-08-12',6);

insert into Journal values('2010-09-01',1,1, true,1), 
	('2010-09-02',1,1, true, 2), 
	('2010-09-03',1,1, false, 1),
          ('2010-09-01',2,1, true,1), 
	('2010-09-02',2,1, true, 2), 
	('2010-09-03',2,1, true, 1),
          ('2010-09-01',3,1, false,1), 
	('2010-09-02',3,1, true, 2), 
	('2010-09-03',3,1, true, 1),
          ('2010-09-01',4,2, true, 3), 
	('2010-09-02',4,2, true, 4), 
	('2010-09-03',4,2, false, 3),
          ('2010-09-01',5,2, true, 3), 
	('2010-09-02',5,2, true, 4), 
	('2010-09-03',5,2, false, 3),
          ('2010-09-01',6,2, true, 3), 
	('2010-09-02',6,2, true, 4), 
	('2010-09-03',6,2, false, 3);

insert into child_lesson values(1,3);

insert into inoculation values(default,'От гриппа'),
	(default,'От столбняка'),
    (default,'От дифтерии'),
    (default,'От турбекулеза');

insert into inoculation_made values(1,4,'2010-03-04'),
	(2,4,'2010-03-08'),
    (3,4,'2009-12-05'),
    (4,4,'2010-05-04'),
    (5,4,'2010-03-02'),
    (1,4,'2010-03-01');
    
insert into disease values(default, 'ангина');

insert into child_disease values(4,1,'2010-09-03',null,null);

insert into allergy values(default,'На витамин C'),
	(default, 'На пыль');

insert into child_allergy values(1,1),
	(2,1),
    (6,2);

    
